{
  "musicians":
  [
    {
      "artist": "Louis Armstrong",
      "songName": "Weather Bird",
      "songLink": "hyb_wr40pog",
      "photo": "louis.jpg",
      "bio": [
        "Louis Armstrong was one of the early pioneers of Jazz music, with a career that spanned five decades. Born in New Orleans in 1901, he grew up in poverty, though he worked for and received support from the Karnoffskys, a Jewish Lithuanian family who helped him to buy his first Cornet. At the age of seventeen, Louis began playing trumpet for Kid Ory's band on riverboats in the Mississippi.",
        "In 1922 he moved to Chicago to join his friend King Oliver's band, where he gained a reputation for his extended and creative trumpet solos. Although race relations were poor in the Northern city, good factory jobs meant that Afro-American workers had money left over to spend on entertainment and Armstrong became a full time musician. During this time, Armstrong's second wife (and pianist), Lil Hardin, encouraged him to broaden his musical repertoire and push for more prominent gigs. In 1924 Armstrong moved to New York for a year to join Fletcher Henderson's orchestra, the top Afro-American band of that era. Afterwards he returned to Chicago where he recorded the iconic Hot Five and Hot Seven sessions. He recorded today's featured song 'Weather Bird' with pianist Earl Hines in between these two sessions.",
        "In the following decade he travelled around the US, developing his singing voice and becoming 'the world's greatest trumpet player'. When Big Band gigs became scarce in the late forties, he formed the very famous 'All Stars' band with many famous ex-band leaders of the era. In 1957 he made national news by criticising President Eisenhower over his inaction during the conflict of school desegregation in Little Rock, Arkansas. In 1964 he recorded his biggest selling record 'Hello, Dolly!', beating out the Beatles and becoming the oldest person to reach number 1 in the Hot 100 chart.  Louis continued to tour for the rest of his life, travelling all over the US, Europe, Africa, Asia and the Soviet Block, earning him the nickname 'Ambassador Satch'."
      ],
      "contributor":"Jack"
    },
    {
      "artist": "Alberta Hunter",
      "songName": "Always",
      "songLink": "WObfOJFALsg",
      "photo": "alberta.jpg",
      "bio": [
        "Alberta Hunter was born in Memphis, Tennessee, on April 1st 1895. She ran away from abuse when she was only 11, heading to Chicago where she took a job in a boardinghouse. By dressing up to look older and lying about her age, she managed to sneak into clubs. Despite having no one to teach her how to read music she asked for a chance as a singer and by 1915 she was singing at the Panama Café and at the Chicago Dreamland Ballroom. In 1921 she moved to New York City, where she was based for most of the rest of her life.",
        "Hunter’s original song 'Downhearted Blues' brought her recognition in 1923 when it was recorded by Bessie Smith. Alberta kept singing in New York city, collaborating with several jazz and blues musicians, including Fats Waller with whom she recorded their famous version of Beal Street Blues in 1927. Between 1927 and 1938 she travelled between the USA and Europe performing both in nightclubs and theatre productions, often accompanied by her partner Lottie Tyler. Their relationship lasted until Ms. Tyler's death, many years later. Alberta always had to be very private about her sexuality given the societal intolerance towards homosexuality. Alberta kept touring the USA during WWII, but after the death of her mother in 1954, she decided to give up singing to begin a career as a nurse.",
        "At that time Alberta was already 59 and so decided to lie about her age again. She pretended to be only 47 in order to get into the three-year YWCA training program. She completed 20 years of service becoming an excellent practical nurse appreciated by her patients. She reached the mandatory retirement age of 70 in 1977, when she was actually 82. Five months after her retirement party, she returned to performing at the Greenwich Village. Her comeback brought even greater fame which lead to the recording of 4 albums. At age 83 she recorded her masterpiece Amtrak Blues, which includes this beautiful song 'Always'. Alberta continued performing until a few months before her death in 1984."
      ],
      "contributor":"Cati"
    },
    {
      "artist": "Sy Oliver",
      "songName": "Tain't What You Do",
      "songLink": "ZFweZ7KF8og",
      "photo": "sy.jpg",
      "bio": [
        "Melvin 'Sy' Oliver (1910-1988) was a trumpet player, vocalist, composer and band arranger. He was one of the musicians that helped define the sound of the big band swing era. He had an incredibly prolific career and wrote many original songs that are now swing classics: He wrote 'T'aint what you do' in 1939 with fellow musician James 'Trummy' Young. Other songs that swing dancers may recognise include 'For Dancers Only' and 'Swingin' on Nothing'!",
        "These songs were some of the biggest hits for Jimmy Lunceford's band, which Oliver joined in 1933. His many talents helped make the band a success. In 1939 he was hired by bandleader Tommy Dorsey for a considerable salary. This was notable as he was one of very few African Americans to have a prominant role in a majority white band. He gave the Tommy Dorsey band it's share of hits as well, including an arrangement of 'On the Sunny Side of the Street' and original composition 'Opus One'.",
        "In 1946 he went freelance, mainly working for Decca records. Over the next couple of decades he would work closely with such stars as Louis Armstrong, Ella Fitzgerald and Frank Sinatra. He continued to live, work & play in New York for the rest of his life."
      ],
      "contributor":"Ellen"
    },
    {
      "artist": "Jean 'Django' Reinhardt",
      "songName": "Minor Swing",
      "songLink": "gcE1avXFJb4",
      "photo": "django.jpg",
      "bio": [
        "Django's music may have been born in the 'old world' but is one of the strongest calls to the dance floor for me, particularly for Bal and Shag. Known as Gypsy Jazz, his whimsical music combines elegance, lightness and melancholy at the same time. He was a Romani-French Jazz guitarist and composer born in Belgium in 1910 to a family of Roma travellers and musicians. He was married twice and had two sons who, along with their own families, also became well-known musicians and are carrying his legacy on.",
        "From an early age, Django played several instruments and toured the streets of Paris as a busker, playing in the street and in small clubs, until he met violinist Stéphane Grapelli, with whom he formed the quintet 'Hot Club de France'. His life was marked by as many ups as downs, one including a fire in his caravan, from which he suffered severe burns, nearly got his leg amputated and lost the use of the little and ring finger of his left hand, at the age of 18. Far from giving up, he focused on the guitar and composed all his music to suit the limited capacity of his hand, notably while being largely illiterate. Not only did he make playing with two fingers possible without diminishing the music, he played with incredible speed and accuracy. The quintet became a huge success in Europe and regularly played with travelling American musicians such as Coleman Hawkins, Eddie South, Bill Coleman, Dizzie Gillespie and Duke Ellington.",
        "WWII put an end to the quintet, and Django, being a Gypsy, had several narrow escapes and was also forced to embrace different styles of music, jazz having been banned by the Nazis. His song Nuages (Clouds, 1940) became an unofficial anthem in Paris to signify hope for liberation. After WWII, Django rejoined with Stéphane Grapelli in the UK and went on to tour the US, playing with Duke Ellington and others in front of large, enthusiastic crowds. However, no contracts materialised out of this, and he eventually returned to Europe, where he continued to evolve as the unique musician he was. He played at numerous events and later incorporated other music styles such as bebop and even tried electric guitar, but he also increasingly gave in to mood swings, wandered off to spend time with his family and developed a reputation for being unreliable. He eventually withdrew to a village 75km south of Paris, Samois-sur-Seine (which is now famous for its jazz festival held annually in his honour). In 1953, he died suddenly from a stroke at the age of only 43 while returning from a gig in a Paris club. He produced 60 records in his time and wrote up to around 100 songs and improvisations that have inspired countless people since."
      ],
      "contributor":"Tina"
    },
    {
      "artist": "Mary Lou Williams",
      "songName": "Walkin' and Swingin'",
      "songLink": "cGyvsLhLI1I",
      "photo": "mary.jpg",
      "bio": [
        "The one and only Mary Lou Williams was an amazing pianist and composer. She learned to play the piano as a kid, by observing her dad and the professional musicians who would visit their family home in Atlanta and then in Pittsburgh. When she was 20 she moved to Kansas City where she became part of the jazz scene and joined Andy Kirk's band.",
        "She composed and arranged for Tommy Dorsey, Benny Goodman, and Duke Ellington. Mary Lou Williams also mentored many musicians, including Charlie Parker and Miles Davis.",
        "Walkin' and Swinging' is a super cruisy tune that she composed for Andy Kirk and his Twelve Clouds of Joy, recorded in 1936. Pay attention Mary’s piano stride at about 1:30!"
      ],
      "contributor":"Cati"
    },
    {
      "artist": "Hazel Scott",
      "songName": "Git Up From There",
      "songLink": "jeXVnplRIO4",
      "photo": "hazel.jpeg",
      "bio": [
        "Hazel Scott (1920–1981) was a Trinidadian-born jazz and classical pianist, singer, and actor. An incredibly talented and successful Woman In Jazz, who used her influence to improve the representation of black Americans in Hollywood. Hazel moved to Harlem with her family when she was 4 and by that time she could play anything she heard on the piano. Hazel Scott studied at the Juilliard School and by the mid-1930s she was performing jazz, blues, ballads, Broadway and boogie-woogie songs, as well as classical music in various nightclubs.",
"She collaborated with the Count Basie Orchestra and had regular gigs at Café Society. She was known for 'swinging the classics'. Hazel Scott was the first person of African descent to have their own television show in the US, The Hazel Scott Show.",
"Scott was also a civil rights activist. She refused to take roles in Hollywood that cast her as a 'singing maid.' She required control over her own wardrobe to avoid disrespectful studio's choices. Hazel Scott also refused to perform in segregated venues when she was on tour."
      ],
      "contributor":"Cati"
    },
    {
      "artist": "Ella Fitzgerald",
      "songName": "Flying Home",
      "songLink": "https://www.youtube.com/watch?v=EExWrybama8&ab_channel=phalenopsis1",
      "photo": "ella.jpg",
      "bio": [
        "Louis Armstrong was one of the early pioneers of Jazz music, with a career that spanned five decades. Born in New Orleans in 1901, he grew up in poverty, though he worked for and received support from the Karnoffskys, a family of Lithaunian Jews who helped him to buy his first Cornet. At the age of seventeen, Louis began playing trumpet for Kid Ory's band on riverboats in the Mississippi.",
        "In 1922 he moved to Chicago to join his friend King Oliver's band, where he gained a reputation for his extended and creative trumpet solos. Although race relations were poor in the Northern city, good factory jobs meant that Afro-American workers had money left over to spend on entertainment and Armstrong became a full time musician. During this time, Armstrong's second wife, Lil' Harding, encouraged him to broaden his musical repertoire and push for more prominent gigs. In 1924 Armstrong moved to New York for a year to join Fletcher Henderson's orchestra, the top Afro-American band of that era. Afterwards he returned to Chicago where he recorded the iconic Hot Five and Hot Seven sessions.",
        "In the following decade he travelled around the US, developing his singing voice and becoming 'the world's greatest trumpet player'. When Big Band gigs became scarce in the late forties, he formed the very famous 'All Stars' band with many famous ex-band leaders of the era. In 1957 he made national news by criticising President Eisenhower over his inaction during the conflict of school desegregation in Little Rock, Arkansas. In 1964 he recorded his biggest selling record 'Hello, Dolly!', beating out the Beatles and becoming the oldest person to reach number 1 in the Hot 100 chart.  Louis continued to tour for the rest of his life, travelling all over the US, Europe, Africa, Asia and the Soviet Block, earning him the nickname 'Ambassador Satch'."
      ],
      "contributor":"Cati"
    },
    {
      "artist": "Duke Ellington",
      "songName": "Rockin' in Rhythm",
      "songLink": "https://www.youtube.com/watch?v=EExWrybama8&ab_channel=phalenopsis1",
      "photo": "ellington.jpg",
      "bio": [""],
      "contributor":"Jack"
    }
  ]
}
